Repository: RazvanMF/RANskril
Catalog: RANskril_GUI/Strings/*/Resources.resw
Source language: en_us
Languages: ro_ro

# HomePage_ButtonInfringe.Content
source: Show Infringing Applications
ro_ro: Prezintă Aplicațiile Malițioase

# HomePage_ButtonRestart.Content
source: Restart to Safe Mode
ro_ro: Repornește în Modul Sigur

# HomePage_ButtonRearm.Content
source: Rearm System
ro_ro: Rearmează Sistemul

# HomePage_ButtonEnable.Content
source: Enable RANskril
ro_ro: Activează RANskril

# MainWindow_NavMenu_Decoys.Content
source: Decoys
ro_ro: Capcane

# MainWindow_NavMenu_Home.Content
source: Home
ro_ro: Acasă

# MainWindow_NavMenu_Logs.Content
source: Logs
ro_ro: Jurnale

# MainWindow_NavMenu_Recovery.Content
source: Recovery
ro_ro: Recuperare

# HomePage_StatusTextSafe.Text
source: No anomalies detected! Your computer is safe.
ro_ro: Nu au fost detectate anomalii. Computer-ul dvs. este în siguranță.

# HomePage_StatusTextUnsafe.Text
source: The system was tripped. Investigate immediately!
ro_ro: Sistemul a fost declanșat. Vă rugăm să investigați!

# HomePage_StatusTextUnknown.Text
source: RANskril is turned off.
ro_ro: RANskril nu este pornit.

# HomePage_ButtonDisable_Content
source: Disable RANskril
ro_ro: Dezactivează RANskril

# DecoyPage_Title.Text
source: Decoy Viewer
ro_ro: Vizualizator pentru Capcane

# DecoyPage_DeploymentSubsectionTitle.Text
source: Decoy Deployment Settings
ro_ro: Setări de Implementare ale Capcanelor

# DecoyPage_DeploymentRatioText.Text
source: Decoy/File Ratio
ro_ro: Rația Capcană/Fișiere

# DecoyPage_HealthText.Text
source: Decoy Health
ro_ro: Bunăstarea Capcanelor

# DecoyPage_HealthTooltip.ToolTipService.ToolTip
source: RANskril handles new folders by adding the top and bottom decoys. To keep the detection net effective, the system can perform folder reseeding and metadata resetting. The options below allow you to perform these operations manually.
ro_ro: Când un director nou este creat, RANskril adaugă capcanele periferice în acesta. Pentru a păstra sistemul de detecție cât mai eficient, serviciul poate executa operații de regenerare ale capcanelor, și de resetare a metadatelor. Opțiunile de mai jos permit utilizatorului să execute manual operațiile.

# DecoyPage_DeploymentRatioTooltip.ToolTipService.ToolTip
source: How many decoys will be created per number of files in the folder (excluding the top and bottom decoys). The default is 16. (i.e. for every 16 files in a folder, a decoy is created) A value of 0 will effectively disable dynamic decoy generation, and just leave the top and bottom decoys.
ro_ro: Cât de multe capcane vor fi create, în funcție de numărul de fișiere din director (excluzând capcanele periferice). Valoarea implicită este 16 (i.e. pentru fiecare 16 fișiere dintr-un director, se va crea o capcană). Valoarea '0' va dezactiva generarea dinamică a capcanelor, în funcție de numărul de fișiere, și va lăsa doar capcanele periferice.

# DecoyPage_DeploymentApplyChangesButton.Content
source: Apply Changes
ro_ro: Aplică schimbările

# DecoyPage_MetadataButton.ToolTipService.ToolTip
source: To keep the decoys looking 'fresh', this will set access and/or creation metadata closer to the present, with the oldest date being 3 days ago at most.
ro_ro: Pentru a face capcanele să pară 'proaspete', operația aceasta va modifica metadatele specifice ultimei dăți accesate și/sau data creării. Data modificată nu va fi mai veche de 3 zile.

# DecoyPage_ReseedButton.ToolTipService.ToolTip
source: Taking into account the decoy/file ratio, this will regenerate all decoys. Depending on how many files are on the system, it might take a bit.
ro_ro: Luând în considerare rația capcană/fișiere, opțiunea aceasta va regenera toate capcanele din sistem. Operația poate dura, în funcție de numărul de fișiere.

# DecoyPage_MetadataButton.Content
source: Reset Decoy Metadata
ro_ro: Resetează Metadatele Capcanelor

# DecoyPage_ReseedButton.Content
source: Reseed Folders
ro_ro: Regenerează Capcane

# DecoyPage_ExcludedFoldersSubsection.Text
source: Decoy Excluded Folders Settings
ro_ro: Setări de Excludere de Directoare ale Capcanelor

# DecoyPage_ExcludedApplicationsSubsection.Text
source: Decoy Application Visibility and Triggering Settings
ro_ro: Setări de Vizibilitate și Declanșare ale Capcanelor

# DecoyView_AddBlindExecutableButton.Content
source: Add a blind executable
ro_ro: Adaugă un executabil orb

# DecoyView_AddExcludedExecutableButton.Content
source: Add an excluded executable
ro_ro: Adaugă un executabil exclus

# DecoyView_AddExcludedFolderButton.Content
source: Add an excluded folder
ro_ro: Adaugă un director exclus

# DecoyView_ViewBlindExecutablesButton.Content
source: View all blind executables
ro_ro: Vizualizează executabilele oarbe

# DecoyView_ViewBlindExecutablesButton.ToolTipService.ToolTip
source: For a plethora of reasons, you can choose to make the decoys completely invisible to an application. Those applications can be seen here.
ro_ro: Pentru o multitudine de motive, puteți alege executabile pentru care capcanele să fie invizibile. Aceste executabile pot fi văzute aici.

# DecoyView_ViewExcludedExecutablesButton.Content
source: View all excluded executables
ro_ro: Vizualizează executabilele excluse

# DecoyView_ViewExcludedExecutablesButton.ToolTipService.ToolTip
source: Legitimate applications, that play nastily with the system, can be excluded. Those applications can be seen here.
ro_ro: Există posibilitatea ca unele aplicații legitime să nu interacționeze frumos cu sistemul, și să fie excluse. Acele aplicații excluse pot fi văzute aici.

# DecoyView_ViewExcludedFoldersButton.Content
source: View all excluded folders
ro_ro: Vizualizează directoarele excluse

# DecoyView_ViewExcludedFoldersButton.ToolTipService.ToolTip
source: Some folders are excluded by default. The user can choose some folders to exclude. They can be seen here.
ro_ro: Unele directoare sunt implicit excluse. Utilizatorul poate deasemenea să excludă directoare. Directoarele excluse pot fi văzute aici.

# DecoyPage_VisibilityAndExclusionSubsection.Text
source: Decoy Application Visibility and Triggering Settings
ro_ro: Setări de Vizibilitate și Declanșare ale Capcanelor

# SettingsPage_Localization.Text
source: Application Language
ro_ro: Limba Aplicației

# SettingsPage_LocalizationDescription.Text
source: You can press one of the buttons below to change the language of the application, to either English or Romanian. (NOTE: Logs will always be in English)
ro_ro: Puteți apăsa unul din butoanele de mai jos pentru a schimba limba aplicației, fie în Engleză, fie în Română. (NOTĂ: Jurnalele vor fi mereu în Engleză)

# SettingsPage_Title.Text
source: Settings
ro_ro: Setări

# DecoyPage_BlindExcludedSubtitle.Text
source: Decoy-Executable Relation Settings
ro_ro: Setări Relație Capcană-Executabile

# DecoyPage_TriggerThresholdSubtitle.Text
source: Decoy Trigger Strategy
ro_ro: Strategie pentru Declanșarea Capcanelor

# DecoyPage_ComboBoxLenient.Content
source: Lenient
ro_ro: Permisiv

# DecoyPage_ComboBoxRestrictive.Content
source: Restrictive
ro_ro: Restrictiv

# DecoyPage_ComboBoxLenient.ToolTipService.ToolTip
source: This will let in any executable that is digitally signed, passes the AMSI checks and ETW process tree checks.
ro_ro: Opțiunea asta va permite execuția oricărui executabil semnat digital, dacă trece și de verificările AMSI și ETW.

# DecoyPage_ComboBoxRestrictive.ToolTipService.ToolTip
source: This will let in only digitally signed executables, that belong to Microsoft. AMSI and ETW checks included.
ro_ro: Opțiunea asta va permite execuția doar programelor semnate digital, și care aparțin de Microsoft. Verificările AMSI și ETW sunt incluse.

# SettingsPage_Theme.Text
source: Application Theme
ro_ro: Tema Aplicației

# SettingsPage_ThemeDescription.Text
source: You can press one of the buttons below to switch to either Light Mode or Dark Mode.
ro_ro: Puteți apăsa unul din butoanele de mai jos pentru a schimba tema aplicației, fie în modul luminos, fie în modul întunecat.

# LogsPage_ServiceTab.Content
source: Windows Service Logs
ro_ro: Jurnalele Serviciului Windows

# LogsPage_KernelTab.Content
source: Kernel Minifilter Logs
ro_ro: Jurnalele Minifiltrului pe Kernel

# HomePage_Toggle.OffContent
source: Enabled
ro_ro: Pornit

# HomePage_Toggle.OnContent
source: Enabled
ro_ro: Pornit

# DecoyPage_DisarmSystem.Content
source: Disarm System
ro_ro: Dezarmează Sistemul

# DecoyPage_DisarmSystem.ToolTipService.ToolTip
source: This option will delete all decoys present on the machine, effectively preparing RANskril for uninstall.
ro_ro: Opțiunea aceasta va șterge toate capcanele de pe sistem, pregătind astfel RANskril pentru dezinstalare.
